export const navigation = [
    {
        text: 'صفحه اصلی',
        path: '/dashboard',
        icon: 'home'
    },
    {

        text: 'سامانه کشف تقلب',
        icon: 'plus',
        items: [
            {
                text: 'گزارشات ريالي',
                path: '/p1',
                icon: 'plus',
                items: [
                    {
                        text: '100 - گزارشات صندوق',
                        path: '/r1',
                        icon: 'plus',
                        items: [
                            {
                                text: '101 -  گزارش کنترل مديريت نقدينگي صندوق',
                                path: '/rs1'
                            },
                            {
                                text: '102 - گزارش مانده نقدي صندوق کاربر',
                                path: '/rs2'
                            },
                            {
                                text: '103 - گزارش کسري /فزوني صندوق کاربر',
                                path: '/rs3'
                            },
                            {
                                text: '104 - گزارش ورود کاربر در زماني غير معمول',
                                path: '/rs4'
                            },
                            {
                                text: '105 - گزارش حذف سيتواسيون شعب و خزانه داريها',
                                path: '/rs5'
                            },
                            {
                                text: '106 - گزارش عمليات خودپرداز',
                                path: '/rs6'
                            },
                            {
                                text: '107 - گزارش سيتواسيون صندوق',
                                path: '/rs7'
                            },

                        ]

                    },
                    {
                        text: '200 - گزارشات سپرده',
                        path: '/r2',
                        icon: 'plus',
                        items: [
                            {
                                text: '201 - تراکنش نقدي مرتبط به حساب مشتريان',
                                icon: 'plus',
                                path: '/rss1'
                            },
                            {
                                text: '202 - گزارش عملکرد 171- برگشت واريز و برداشت',
                                icon: 'plus',
                                path: '/rss2'
                            },
                            {
                                text: '203 - گزارش خدمات براي اشخاص با وضعيت استعلام منفي و فاقد استعلام از ثبت احوال',
                                icon: 'plus',
                                path: '/rss3'
                            },
                            {
                                text: '204 - گزارش کارمزد پرداخت نقدي از حسابهاي افتتاحي ساير شعب',
                                icon: 'plus',
                                path: '/rss4'
                            },
                            {
                                text: '205 - گزارش حساب هايي که در بازه زماني معين شرايط برداشت آنها بيش از تعداد مشخصي تغيير نموده است',
                                icon: 'plus',
                                path: '/rss5'
                            },
                            {
                                text: '206 - اصلاحات صورت گرفته در فرم افتتاحيه حساب',
                                icon: 'plus',
                                path: '/rss6'
                            },
                            {
                                text: '207 - گزارش تغيير مالکيت صاحب حساب انفرادي و اشتراکي',
                                icon: 'plus',
                                path: '/rss7'
                            },
                            {
                                text: '208 - حسابهاي راکد',
                                icon: 'plus',
                                path: '/rss8'
                            },


                            {
                                text: '209 - گزارش بازديد صورتحساب و مانده گيري کاربران',
                                path: '/rss9'
                            },
                            {
                                text: '210 - گزارش بازديد صورتحساب و مانده گيري توسط کاربران',
                                path: '/rss10'
                            },
                            {
                                text: '211 - جستجوي اطلاعات مشتريان',
                                path: '/rss11'
                            },
                            {
                                text: '212 - گزارش ليست دارايي ها و بدهي هاي يک مشتري',
                                path: '/rss12'
                            },
                            {
                                text: '213 - گزارش ليست تراکنشهاي يک حساب',
                                path: '/form213'
                            },
                            {
                                text: '214 - گزارش حساب هاي افتتاح شده',
                                path: '/rss14'
                            },
                            {
                                text: '215 - گزارش مسدودي و رفع مسدودي',
                                path: '/rss15'
                            },
                            {
                                text: '216 - گزارش آماري برداشتهاي با کد شاخص بدون کارت',
                                path: '/rss16'
                            },
                            {
                                text: '217 - گزارش جزئيات برداشتهاي با کد شاخص بدون کارت',
                                path: '/rss17'
                            },
                            {
                                text: '218 - گزارش خلاصه عملکرد اصلاح اطلاعات مشتريان',
                                path: '/rss18'
                            },
                            {
                                text: '219 - گزارش جزئيات اصلاح اطلاعات مشتريان حقيقي',
                                path: '/rss19'
                            },
                            {
                                text: '220 - "گزارش جزئيات اصلاح اطلاعات مشتريان خارجي',
                                path: '/rss20'
                            },
                            {
                                text: '221 - گزارش جزئيات اصلاح اطلاعات مشتريان حقوقي',
                                path: '/rss21'
                            },
                            {
                                text: '222 - گزارش خلاصه عملکرد حسابهاي دريافت کننده دسته چک غيرمجاز',
                                path: '/rss22'
                            },
                            {
                                text: '223 - گزارش دسته چک هاي غير مجاز',
                                path: '/rss23'
                            },

                            {
                                text: '224 - گزارش خلاصه عملکرد تخصيص دسته چک به حسابهاي داراي چک برگشتي',
                                path: '/rss24'
                            },
                            {
                                text: '225 - گزارش ريز عملکرد تخصيص دسته چک به حسابهاي داراي چک برگشتي',
                                path: '/rss25'
                            },
                            {
                                text: '226 - گزارش چک هاي برگشتي',
                                icon: 'plus',
                                path: '/rss26'
                            },
                            {
                                text: '227 - گزارش خلاصه استعلام هاي مشتريان حساب هاي جاري',
                                path: '/rss27'
                            },
                            {
                                text: '228 - گزارش ليست استعلام هاي مشتري',
                                path: '/rss28'
                            },
                            {
                                text: '229 - گزارش سپرده بلند مدت',
                                path: '/rss29'
                            },
                            {
                                text: '230 - گزارش تبادلات صادر شده',
                                path: '/rss30'
                            }
                        ]

                    },
                    {
                        text: '300 - گزارشات خدمات',
                        path: '/r3',
                        icon: 'plus'
                    },
                    {
                        text: '400 - گزارشات تسهيلاتي',
                        path: '/r4',
                        icon: 'plus'
                    },
                    {
                        text: '500 - گزارشات حسابداري',
                        path: '/r5',
                        icon: 'plus'
                    },

                ]
            },
            {
                text: 'گزارشات ارزي',
                path: '/p2',
                icon: 'plus',
                items: [
                    {
                        text: 'گزارشات ارزي',
                        path: '/a1',
                        icon: 'plus',
                        items: [
                            {
                                text: '601 - گزارش ريز تبادلات کاربر با صندوق/کاربر',
                                path: '/aa1'
                            },
                            {
                                text: '602 - گزارش حد نگهداري بيمه ارز در صندوق',
                                path: '/aa2'
                            },
                            {
                                text: '603 - گزارش خلاصه وضعيت مازاد بر حد بيمه صندوق ارز',
                                path: '/aa3'
                            },
                            {
                                text: '604 - گزارش ريز گردش مازاد بر حد بيمه صندوق ارز',
                                path: '/aa4'
                            },
                            {
                                text: '605 - گزارش خلاصه عملکرد اسکناس و نقود صندوق شعبه',
                                path: '/aa5'
                            },
                            {
                                text: '606 - گزارش دريافت و پرداخت نقدي',
                                path: '/aa6'
                            },
                            {
                                text: '607 - گزارش رديابي تراکنش هاي دريافت و پرداخت نقدي',
                                path: '/aa7'
                            },
                            {
                                text: '608 - گزارش خلاصه عملکرد سرقت وجوه صندوق',
                                path: '/aa8'
                            },
                            {
                                text: '609 - گزارش ريز عملکرد سرقت وجوه صندوق',
                                path: '/aa9'
                            },
                            {
                                text: '610 - گزارش تعداد و مانده سپرده هاي ارزي به تفکيک نوع حساب',
                                path: '/aa10'
                            },
                            {
                                text: '611 - گزارش تعداد و مبلغ حواله هاي وارده/صادره ارزي',
                                path: '/aa11'
                            },
                            {
                                text: '612 - گزارش خريد و فروش ارز',
                                path: '/aa12'
                            },
                            {
                                text: '613 - گزارش درصد ارجاع حواله هاي صادر ارزي به کارگزاران',
                                path: '/aa13'
                            },
                            {
                                text: '614 - گزارش خلاصه خريد و فروش ارز غيربازرگاني',
                                path: '/aa14'
                            },
                            {
                                text: '615 - گزارش مقايسه اي وضعيت حواله هاي وارده/صادره ارزي در مقاطع مختلف',
                                path: '/aa15'
                            },
                            {
                                text: '616 - گزارش ريز خريد و فروش ارز غير بازرگاني',
                                path: '/aa16'
                            },
                            {
                                text: '617 - گزارش خلاصه کسري- فزوني صندوق',
                                path: '/aa17'
                            },
                            {
                                text: '618 - گزارش ريز کسري- فزوني صندوق',
                                path: '/aa18'
                            }
                        ]
                    },
                    {
                        text: 'گزارشات حسابداري ارزي',
                        path: '/a2',
                        icon: 'plus'
                    },]
            },
            {
                text: 'شاخص ها',
                path: '/p3',
                icon: 'plus'
            },
            {
                text: 'کارتابل',
                path: '/p5'
            },
            {
                text: 'چارت سازماني',
                path: '/p6'
            },
            {
                text: 'مديريت سيستم',
                path: '/p7',
                icon: 'plus'
            },
            {
                text: 'گزارشات مديريتي',
                path: '/p8',
                icon: 'plus'
            },
            {
                text: 'منو',
                path: '/p9',
                icon: 'plus'
            }
        ]
    },
    {
        text: 'مشخصات کاربر',
        path: '/display',
        icon: 'setting'
    },

];
